---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.ElementsWithNotCopiedParentsDeleted
source: html/358dc8fd-50c2-a30d-d065-56929e74f70e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.ElementsWithNotCopiedParentsDeleted Property

Some elements were deleted because elements that they require for references were not copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsWithNotCopiedParentsDeleted { get; }
```